src/cf/project/InformationRegisters/НастройкиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/project/InformationRegisters/ИсторияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбмена</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
						<v8:Type>cfg:CatalogRef.КартыЛояльности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/project/Enums/ВидыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправкаСообщений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧтениеСообщений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/project/CommonModules/РаботаСRabbitMQ/Ext/Module.bsl
Процедура ОтправитьСообщение() Экспорт
	
	Компонента = ПолучитьКомпонентуСервер();  
	ВидОбмена = Перечисления.ВидыОбмена.ОтправкаСообщений;
	ПараметрыОбмена = РегистрыСведений.НастройкиОбмена.ПолучитьПараметрыОбмена(ВидОбмена); 
	
	СписокСообщений = РегистрыСведений.ИсторияОбмена.СоздатьНаборЗаписей(); 
	СписокСообщений.Прочитать();
	
	Для Каждого Сообщение Из СписокСообщений Цикл  
		
		Попытка
			Компонента.Connect(
			ПараметрыОбмена.Адрес,
			ПараметрыОбмена.Порт,
			ПараметрыОбмена.Логин,
			ПараметрыОбмена.Пароль,
			ПараметрыОбмена.ВиртуальныйХост);
			
			ТочкаОбмена    = ПараметрыОбмена.ТочкаОбмена;
			ИмяОчереди     = ПараметрыОбмена.ИмяОчереди;
			ТекстСообщения = Сообщение.Сообщение;
			КлючМаршрутизации = ПараметрыОбмена.КлючМаршрутизации;
			
			Компонента.BasicPublish(
			ТочкаОбмена,
			КлючМаршрутизации,
			ТекстСообщения,
			1,
			Ложь);
						
		Исключение
			СистемнаяОшибка = ОписаниеОшибки();
			ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;      
		
	КонецЦикла;
	СписокСообщений.Очистить(); 
	СписокСообщений.Записать();
		
КонецПроцедуры

Функция ПолучитьКомпонентуСервер()

	Компонента = Неопределено;
	Если Не ИнициализироватьКомпоненту(Компонента) Тогда
		
		ПодключитьКомпоненту();
		ИнициализироватьКомпоненту(Компонента);
		
	КонецЕсли;
	
	Возврат Компонента;	
	
КонецФункции 


Процедура ПрочитатьСообщение() Экспорт         

	Компонента = ПолучитьКомпонентуСервер();

	ВидОбмена = Перечисления.ВидыОбмена.ЧтениеСообщений;
	ПараметрыОбмена = РегистрыСведений.НастройкиОбмена.ПолучитьПараметрыОбмена(ВидОбмена);	
	
	Попытка
		Компонента.Connect(
			ПараметрыОбмена.Адрес,
			ПараметрыОбмена.Порт,
			ПараметрыОбмена.Логин,
			ПараметрыОбмена.Пароль,
			ПараметрыОбмена.ВиртуальныйХост);
		
		ИмяОчереди = ПараметрыОбмена.ИмяОчереди;
		
		Попытка
			
			Потребитель = Компонента.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Если Компонента.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				Компонента.BasicAck(); 
				
				ДесериализацияJSON(ОтветноеСообщение);
				
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Иначе
				ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Очередь пустая!'");
			КонецЕсли;
			
			Компонента.BasicCancel("");
		Исключение
			ВызватьИсключение Компонента.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;	
	
КонецПроцедуры

#Область ПодключениеИнициализацияКомпоненты 

Функция ИнициализироватьКомпоненту(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции 

Процедура ПодключитьКомпоненту(КомпонентаПодключена = Неопределено)
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(АдресВоВременномХранилище, "BITERP", ТипВнешнейКомпоненты.Native);
	
КонецПроцедуры 

#КонецОбласти  

#Область СлужебныеПроцедуры

Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	                            
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("RabbitMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
		
КонецФункции  

Процедура ОтправкаСообщенийВRabbitMQ() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

 
Процедура ДесериализацияJSON(JSONСтрока)
 			
	НачалоJSON = СтрНайти(JSONСтрока, "{");
	
	Длина =  СтрДлина(JSONСтрока);
	
	Объект = Сред(JSONСтрока, 0 , НачалоJSON - 1); 
	
	ТипОбъекта = Тип(Объект);

	JSONСтрока = Сред(JSONСтрока, НачалоJSON, Длина); 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	ОбъектXDTO = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, ТипОбъекта);   
	
	ОбъектXDTO.Записать();	

КонецПроцедуры

Процедура ПолучениеСообщенийВRabbitMQ() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти
